[
{"Review_ID": "R3W3JCMV8YE5BQ", "Author": "Mark Albala", "Review": "I will update this review in a few days, there are a couple of statements I need to state.  First, the documentation is completely void from this camera.  If you don't have the appetite for \"figuring it out\" then don't bother.  GoPro, you can do better in sending a simple 10 page quick start guide, I know all the materials are in the video but...  I first did not know where the buttons were, I finally figured that out, then by accident paired with the phone and from there things became easier.  The software at first glance looks fine, of course I will figure out more once I start using it more heavily. Only from reading, I understand that folks have had issues with the software.  GoPro, you have an edge right now, don't blow it because of crappy software, if you cant do it yourself partner with someone, but the software is probably more important than the hardware in making compelling 360 videos and 2D videos from 3D source.  Don't set the bar and then let others cross it because of inferior software.  Bite the bullet and just fix it. Amazon, I hope you are reading this, you would do buyers a great service if you could post a quick start guide for buyers and potential buyers, not a video for 360 fanboys, but a quick start guide for folks like me, who want to take immersive video while on vacation.  I will try to put together a quick guide over the next couple of weeks and post it, but Amazon, you stand to make lots of sales if you can show how the 80% of folks can get what they need from this camera by understanding 20% of its capabilities."},
{"Review_ID": "R3OSE2WRNTZ5KP", "Author": "Mitchell", "Review": "This review is a work in progress. My initial thoughts are dated below: 2/6/2018 I caved in and bought a Fusion after watching a few sample videos online. I'm nowhere near as extreme as most of the people in GoPro's official videos, but I am an avid photographer that is interested in new methods. Prior to this the only 360 photos I had taken were either from an LG 360 Cam (which was okay for the price) and through Google Photosphere with a phone (which takes awhile to make). So far I've only used the Fusion for stills, and the results have been great for the most part. The biggest flaws in the photos tend to happen around the two endpoints that separate each lens, where you will see more blur and occasional stitch errors, especially when dealing with solid lines. Aside from that, picture quality is astonishing with RAW and even with JPEG. Another big thing to mention about this camera is connectivity with your devices: I'm often on the go and rely on my iPad or Android smartphone, so I have my options. What I've noticed is that each platform's GoPro app has problems that need to be addressed: iOS offers more support with many Apple devices and has the capability of sharing 360 video, but the app dropped connection often, the viewing of 360 content was difficult to focus on a single point, and there are some weird black and white lines that remain in the same spot on every photo; Android has very limited support for phones and doesn't allow sharing 360 video, but the app seemed to run better than the iOS version, didn't disconnect as much, and didn't have the black and white lines in the photos. I hope GoPro sorts this mess out for Android users as that is my primary device, and I will update my review when they do. 2/15/2018 Tried out some video recording on a roller coaster with the Fusion mounted on my wrist, but haven't been able to upload it yet due to the enormous estimated file sizes and lack of time . The preview looks fairly stable except when dealing with steep drops, but it's still usable. 360 audio sounds just as I experienced the ride, so that's great. Going back to the iOS and Android apps, I noticed that if you upload a 360 photo to Facebook with the iOS app, the black lines I mentioned earlier upload with it whereas the same photo uploaded via Android does not have the black lines. This is a little absurd, and adds to my gripes about the camera. 4/30/2018 I've been rather busy with this camera and finally got the time to try out the Fusion Studio desktop app... and you'll need A LOT of time. I wasn't expecting a fast render considering that I'm using my 2011 MacBook Pro with an Intel Core i7 and 8GB RAM, but the time it takes to render and the file sizes it makes are massive: for a 1:36 5.2K30 video (1 minute and 36 seconds) using the default Facebook settings, it took at least 20 minutes to reach 17% before I fell asleep and had a file size of 10.55GB in the end. There are other render settings to use for editing in Adobe Premiere, YouTube, or Vimeo that I haven't tried yet, but Facebook has the lowest settings so expect more time to do any of those other ones. On top of all this, you'll need a stellar internet upload speed to share these videos due to their huge file sizes (as of this writing my video has been trying to upload to Facebook for about 15 minutes at 75% completion). From what I've read is that Fusion Studio does a much better job at stitching than on the mobile app, but at the cost of much slower speeds. On the positive side, the video quality looks absolutely gorgeous. I have yet to try a night time video for the reasons listed above, and will update my review again when ready. I'd currently put this camera at 3.5 stars mainly for the software problems. 5/21/2018 The Android app recently got updated to include Overcapture editing. I tried it out with a 2 minute clip of me riding King Arthur Carrousel at Disneyland, and was slightly annoyed by the process. You start by framing your shot with either landscape or square video using your finger or gyroscope, press the record button, and make adjustments as the video plays. While this sounds simple enough, the framing part is executed poorly: I was not able to maintain a fixed frame as the video automatically slowly rotated. Using your finger to constantly adjust the frame makes the footage look jittery, so to compensate for both of these problems I stood up and spun my body with the rotations of the gyroscope to keep the footage roughly around where I wanted it to be. The end result has okay stability, but I know it could be a lot better if GoPro let us pick a fixed position that won’t automatically move unless I tell it to."},
{"Review_ID": "RYFUBELV4SJC2", "Author": "steve martin", "Review": "I'll start by saying that the Fusion delivers really clean 5.2 K spherical video and it's really fun to shoot with. Using the free Fusion Studio app on Mac (haven't tried the Windows version), you can render out very nice video images with gimbal-like stabilization. It's the best stabilization I've ever seen on a 360 camera. Even with walking and micro vibrations, the hardware/software combination yields buttery-smooth movement. Using the Fusion is like having 2 GoPro Heros strapped back to back, and the Fusion Studio software allows you to do what GoPro calls \"overcapture\" which is to say you can do 16:9 HD or 4:3 cutouts from any part of the 360 sphere. But to be clear, you don't need Fusion Studio to do 16:9 cutouts. This can easily be done in Final Cut Pro X or Premiere by putting the equirectangular clips into a standard 1080 timeline, then adjusting the orientation of the sphere. The footage cuts perfectly into a project with other GoPro aquired1080 footage. Now the not-so-good news. The app itself is really, really slow to stitch. I have an iMac Pro 8 Core and 12 minutes of video took 8 hours to render!! Fortunately, I use another Pro stitching software, and it only took 1 hour for the same footage. So GoPro has to improve how the app is using the CPU. Assuming your clips are relatively short and you're patient, (let the clips render overnight) the camera is truly the best 360 camera I've used (and I've used a lot of them)."},
{"Review_ID": "R2OMA8CHVALO6Q", "Author": "Willie V. Hughes", "Review": "I've had several GoPros (a half dozen over the years), and I'm a early-adopter of consumer 360 video. This camera was specifically purchased to replace my Samsung Gear 360 which easily produces 360 video, but has sub-par video quality. Given that the GoPro Omni runs about $1,400, the GoPro Fusion is a steal at less than half that cost. This GoPro Fusion is a beast. The housing is 2-3 times larger than even the largest other GoPro models, the battery is about twice as large, and the camera requires two micro-SD cards to even function (one card for the forward-facing lens, and one card for the rear-facing lens). The files are also HUGE (more on that later). Thankfully though, even though the camera is physically much larger than any other GoPro before it, it still uses the same versatile mounts. The GoPro Fusion looks and feels like a camera that has potential, but GoPro has got to get better file compression and make the app/software integration better. I was totally unable to stitch and render any 360 video on my phone because of the massive space requirements, so I downloaded the Windows 10 desktop software. When I then tried to stitch and render a video of approximately 1.5 minutes in length, I could see that the resulting file would take hours to render (not including the time it'd take to then upload it later to YouTube) and would be nearly six gigabytes in size. To be clear, that's one huge video. This estimated size I was given for a 1.5 minute video with the GoPro Fusion was the same as the average rip of a 2-hour Blu-Ray video. The sheer size of the files that the GoPro Fusion produces and the fact that the computer horsepower required to stitch and render them is quite significant makes this a no-go for me. Unless you're going to stick to filming videos of only a few seconds in length, any videos that are a few minutes in length will require hours of your time. That's just too heavy of a commitment for me to have the latest/greatest in \"wow\" factor videos. I'd rather invest the time and money in full-frame video from a mirrorless camera or using another GoPro action cam. To be clear, this camera has awesome potential and the image quality is outstanding (it's an absolute game changer). But the technology is so cutting edge that I don't see this being a practical camera unless you're a pro or pro-am with hardcore hardware and a lot of time on your hands."},
{"Review_ID": "R2DR439DERUUXJ", "Author": "VB", "Review": "Produces best stitching and video quality and stabilization out of all 360 cams under $1000 Possibilities are endless when editing footage in Premiere Pro using the over capture plugin. Stitching does take a while even on a 8 core cpu and high end video card but being able to trim video before stitching helps cut down on time, my computer isn't complaining about stitching overnight, well worth the results. Haven't tried any of the mobile apps because I strongly prefer editing footage on PC, I'm sure 5.2k video can get tough for phones to handle not to mention the amount of space it requires. You will have problems editing the footage on PC if the camera costs more than your pc. Don't expect your $400 budget PC to handle 5.2k video"},
{"Review_ID": "R1CHM6F48JFQR7", "Author": "Bright Day", "Review": "The iPhone app is buggy, but you don't need it, it's a 360, think about your placement of the camera and shoot.  The images are night and day over my Insta360 Nano, as it can shoot in night and day too.  The Fusion software running on a 2010 Mac Pro 5.1, is so far rock steady doing almost 100 clips.  My Mac Pro is a basic Intel cheese grater model with 24GB RAM and a Sapphire 580 8GB GPU.  The render time is approx 11 minutes to render 1 minute of 5.2k Cineform.  I do own DaVinci Resolve Studio 15 (the paid one, you can buy a Resolve Dongle on an auction site for cheap).  The Cineform 5.2k files playback a little choppy on editing, but not enough of a problem to edit with. I have never owned any GoPro before, I always preferred Sony action cams more.  I have to say this one is an excellent camera for 360 VR work. This is more of a professional workflow camera, if you just want to do quick 360 video or photo, get an Insta360 Nano S.  If your aspiring for more, get a Fusion.  The only drawbacks are, the audio really picks up even a slight breeze, and one of the sides has a more noticeable stitch line then the other.  Image wise, this one looks nice."},
{"Review_ID": "R2EWTH6VJV5452", "Author": "MPC-Chicago", "Review": "The camera seems to take excellent 360 photos, and short videos as far as I can see from my mobile gopro app. But the big caveat is that the desktop software, Fusion Studio, that you are supposed to use to unload all of the massive images and videos to your desktop simply does not work.  Trying to connect my camera to my mac has taken hours, and it still isn't working.  It is NOT simple plug and play.  This is clearly a known issue due to the number of times the connectivity problem appears in online gopro help forums, but there is simply no substantive help that works anywhere.  This is extremely frustrating - you spend time taking videos and you rely on the camera, and you cannot unload the footage without popping the cards out and unloading those - that is a much more complex method than on a normal gopro  or other digital camera. Very very frustrating for such an expensive camera."},
{"Review_ID": "RTM5R2HB93M4B", "Author": "fkboss", "Review": "GoPro Fusion is an outstanding product, but it does *not* seem to be ready for use yet (at best, I'd call it a \"beta\" or \"alpha\" version). The camera firmware, as well as the mobile app (using iOS app on iPhone X), are both very buggy, unreliable and rather frustrating to deal with. Specific problems I've encountered in the first few hours with the product: - camera failed to charge reliably - firmware update froze at the end \"step 2 of 2\" until it completely drained the battery and reset - retrieving live video and/or media via iOS app was not reliable (connection often lost; blank video sent; no good error / debugging messages) - camera often froze / failed to turn on (required battery removal) - video recording wouldn't start without power-cycling camera"},
{"Review_ID": "R2OEDH84FDRSLW", "Author": "Armin", "Review": "Vompare to all 360 cameras in the market, this is the best one!! But 0- this camera is expensive 1- this needs 2 memory cards! Make it more expensive. 3- iphone app is not super powerful like desktop so you need a PC for sure! 4- no live option! 4- no google street view direct support"},
{"Review_ID": "R3HUHSB4E4ETX0", "Author": "NT86", "Review": "I had little trouble getting started with this camera. It appears as though GoPro has fixed their bugs at initial launch with some firmware patches. I think there is little understanding or documentation on how to use and edit these kinds of cameras, but if you have experience with stitching panoramas or editing in Adobe Premiere or Photoshop, you should be able to figure out how to use this camera within a few hours. Editing in 360 as well as their overcapture/reframe mode take about the same skill level. Pros: -The stitching in the software is almost always on point, there will always be imperfections, but for the most part, stitching at eye level viewing angles is consistent. -Multi axis stabilization (software based stabilization) is very impressive, and holds the camera angle in place (in my case I've noticed by default it points north at the horizon, regardless of  how you physically move the camera) which makes for great footage from a moving vehicle going over rough terrain (emulates human head movement) or while walking and unintentionally twisting/tilting camera. In low light you do get some strange blurring, so I cannot always recommend using it, but you can choose whether you need it after recording your video. -Battery life is good; usually doesn't run out of battery during a day's worth of casual use. Probably had the battery run down over an 8 hour period with about an hour's worth of clips taken -stitching software offers a lot of export modes, camera raw adjustments (for both video and photo) -voice recognition is pretty accurate, does not get a lot of false positives. Of course your friends will want to talk over you when you try to use voice commands -type C charging -editing in premiere with the provided plugins is surprisingly easy if you are experienced with premiere, not too difficult to learn if you are new to premiere. If you don't know how to edit in premiere, I think gopro's quik works with this camera, but I haven't tested it. -App works well (android) to preview shots in 360, and play back files from the camera before rendering. Its a little slow and sometimes a pain to connect to, but overall very usable. Cons -wake time is slow, takes about 10-15 seconds to start up, so it is not super convenient for the unexpected, but when it is powered on, it will start recording immediately -Price point is a bit steep. I'd say I got my money's worth, but for some, the price is steep -requires a lot of hard drive space on your computer, I would recommend having about 4 TB available to sandbox around with this camera. Premiere will need more swap disk space than normal -need a newer computer to edit video, especially when using the reframe function. Don't expect your 6 or 7 year old computer to play nicely with this camera. It kind of works on my 7 year old desktop, but I get a lot of errors in Premiere. Works flawlessly on my new laptop. -about every minute of raw footage is about 1 GB of video files before stitching, files get bigger after stitching. Conclusion: If you are in the market for a 360 camera, and don't have a serious budget constraint, I would pick this camera, as it is made and supported by an American company. There are some great low budget cameras that have similar specs on the market, but they are from relatively new Chinese companies, so I don't know if I trust them to support the camera long term, even though gopro has been struggling themselves."},
{"Review_ID": "R1270H1KRP2GCO", "Author": "Clark", "Review": "I haven't had a chance to review any footage yet, but that's because this camera makes it nearly impossible. - It won't connect to my PIxel 3, a brand-new smartphone (it's not supported it) - It took about 2 hours to transfer a 1min video to my MBP with Fusion Studio - That video is about 6gb, and won't play anywhere (either in Fusion Studio or just a player) - It's asking I update the Fusion, says easiest way is with the app (which I can't use) Fairly brutal first setup. No way to review footage, no way to share with my phone or computer, no way to update. Zoinks."},
{"Review_ID": "ROEPDOKFKT1LA", "Author": "Bhboy14", "Review": "hello there, I can't see anything on my phone galaxy s7 edge (No preview or live feed on Galaxy S7 Edge only black screen i try it with my firends phones same issu  ) for that price if I take two Chines 360 cam it's better ...I think GoPro better than that but I disappointed it's not usable at all no thanks. I sent the fusion back. I dont want to be a Beta Tester and have to pay 699+shipping for that. if you want me to test out new products in Beta, you are welcome to pay me for that. best"},
{"Review_ID": "RKTKGSOPH6CX7", "Author": "Amazon Customer", "Review": "May shoot 360 video but cant do anything with it afterwards.  Software sucks!  Wish I could return it for a refund!!"},
{"Review_ID": "R2EUS2O48XJSV0", "Author": "E. Caspersen", "Review": "The Fusion has its flaws - like any other brand - but for what it's worth I'm happy, happy enough to buy a second one.  Shooting (and editing) in 360 is not only a learning curve, but introduces technical challenges in storage and rendering speed. The problems I see people run into can be experienced with any 360 camera. Overall I think the Fusion is in the top 3 for consumer level 360 cameras in the price range."},
{"Review_ID": "R2YA4QT9V1M8GS", "Author": "Think Outside", "Review": "Absolutely love the gopro 360 fusion. Ive filmed hundreds of clips so far. The included downloadable software very easy to use."},
{"Review_ID": "R38GQ19H9KJN9Y", "Author": "West6550", "Review": "This is the perfect camera for hiking shots. You can walk with it and the stability does great. Or set it down at a bend in the trail to get a cool shot. Just a fun camera to use. It might take some time in post, however you would have to set up a lot more equipment to get cool perfectly smooth pans like this thing does by simply turning it on and setting it down on the tripod."},
{"Review_ID": "RNLJHHME9B6KR", "Author": "Mitch", "Review": "I love this camera.  My only complaint is the process time to stitch the footage into a single movie file.  It takes a LONG time to process."},
{"Review_ID": "R2OHTZ3ZMAO4GX", "Author": "Matt Krass", "Review": "I wanted a 360 camera for when taking vacations to capture spherical photos and videos of my travels for use in my VR headsets. I looked at reviews and samples and wanted the highest possible image quality without getting in to professional costs, which lead me to the GoPro. It lives up to the hype on image quality, and the stabilization is awesome. That is unfortunately where the good note ends. The companion Android app is terrible, it's an awful UI, it's laggy, unresponsive, constantly losing wireless connection to the camera. It crashes often, can't export images out of the app to make available to the rest of the phone, frequently the live video feed would disappear. It's basically unusable, and since the camera doesn't have a reasonable self timer, there is no other good way to trigger the shutter without holding the camera with my face blocking half of the field of view, without of course buying another wireless remote that probably won't work well. The Fusion Studio application for stitching photos and videos together just straight up doesn't run on half of my computers, and the other half it runs poorly. It tends to hang, it comes with no useful documentation, you just kind of muddle through it blindly. The video encoder settings are limited to three codecs, two of which are not commonly useful for consumption by VR devices, and the third one limits the resolution for no reason. You can invoke the encoder from the command line and generate videos at the full 5.2k resolution no problem, and they look great, if it happens to run and finish and not crash that is. This is also not documented of course, I had to figure it out for myself. Finally, the included Fusion stick/tripod (which you must use because it doesn't have a standard tripod mount, unless you once again spend more money) broke on me the third time I tried to use it, the telescoping mechanism jammed and when I tried to unjam it, it just broke in half. Turns out the rugged GoPro product is held together by cheap glue and sloppy tolerance plastic shims. So, this is of course going straight back to Amazon. I'm frankly very disappointed in GoPro, this offering is expensive and has the quality of a McDonalds happy meal toy."},
{"Review_ID": "R3MXZN9EP70UD7", "Author": "Bob Farabaugh", "Review": "Awesome camera at a great price! 360mdegree video and photos will change the way you document your adventures"},
{"Review_ID": "R1WSCJ27J7JZWC", "Author": "todd m", "Review": "I purchased this after trying the Rylo.  It was a few hundred dollars more than the Rylo, but the Rylo was a disaster. Purchased this camera in efforts to record kids basketball games without having to Pan the camera back and forth.  The Overcapture feature was the winning feature on this camera along with the 5.2k resolution (so you can zoom and overcapture) which pushed me to give this camera a try. Pros: -GoPro built -less buggy than the Rylo -the remote interface on the phone to control the camera is great, but it's very buggy -although i didn't use it, the included selfie stick is awesome -the stitching is awesome, easy and brainless (no small feat) Cons: -The remote interface is buggy. -128GB (64G x2) will only give you about 2h40min of recording time at 3k resolution -most importantly.... the 5.2k just isn't enough.  Once my basketball videos were taken and editing or watching with the overcapture feature at 5.2k, the players were completely undiscernable and fuzzy.  Not a problem using a GoPro 5 Blk at 720 or 1080p. -chomps through the battery in a short time, better to use an external battery for long planned recordings Here it is.  If you want a camera to record your self going down the slopes, riding a wave, skateboarding or whatnot but don't plan to zoom in and don't mind the reduced resolution (5.2k is a lot, but not considering when you think it covers ALL 360 degrees at ALL elevations) - this is your camera.  It's better than the competition. The remote software on the iPhone IS buggy.  constantly crashes and you have to exit it and start over again to gain control of the camera.  Loses the camera's wifi from time to time despite being within 5 feet of it.  The remote viewing konks out from time to time as well - again fixed by exiting and restarting.  This will probably get fixed with firmware/app updates. Again, I'm recording basketball games from the sideline.  Zooming in to capture 1/2 of the court does make the video very very fuzzy as 5.2k just isn't enough.  Remember, it's 5.2k all 360 degrees and then UP and Down.  Therefore even a 2k, 720 etc is far more resolution for the framed screen than this one. Three stars to GoPro for this effort.  I get it.... it's hard.  5.2k is a lot to record and the file sizes get huge.  They did an amazing effort on the easy to do stitching.  The firmware/software is buggy at best.  They easily beat the current competition.  However at $800 this is not the camera to record sports for watching afterwards if you need greater or equal resolution to your current GoPro. After trying three 360 degree cameras, I've come to the conclusion that NO current 360 setup is technologically here yet.  The professional VR rigs you can buy for $10k and require lots of editing and stitching will do it, but for a consumer, it's just not here and technological hurdles still need to be solved/invented."},
{"Review_ID": "R2ZK1S21I2K7YJ", "Author": "Trevor Parker", "Review": "Love this camera. It is very easy to use. Does a great job."},
{"Review_ID": "R31XSVDYF3P3G2", "Author": "Guy", "Review": "Produces blurry video.  Camera always overheats and locks up.  Have had so much trouble it's not worth my aggravation.  Spents hours capturing video and photos on my vacation to find out all my time was wasted.  Nothing even close to 4k quality.  What a waste of money.  Don't plan on using it underwater because the results get even worse."},
{"Review_ID": "R2FCQIGOEYSLKS", "Author": "R Blaser", "Review": "Product did not work new out of the package. Had to send back to GoPro and still havent received a new one. This might be fine for most people living in the US but I live internationally so shipping products is not easy."},
{"Review_ID": "R3AOOYQ89XQ4D4", "Author": "AndrewCCM", "Review": "Short and sweet.  How can a camera of this price, category, and technology omit the MOST BASIC OF ALL CAMERA FUNCTIONS?  I can think of no camera released in the past 10yrs that costs 1/10th of this one that blows off the implementation of Exposure and White Balance Control.  Literally, you CANNOT lock your exposure or WB and cannot choose shutter speeds.  Sure..AUTO EVERYTHING with a simple +/- EV control can work fine in easy environments... but go in and out of shadows, mixed light...shoot time lapse, etc and watch that exposure and white balance bounce all over the place.  I honestly expected more from GoPro and it never even crossed my mind that these BASIC features would be excluded.  For me, I may just have to return it as I cannot accept these limitations no matter how great it looks in bright even sunlight.  PLEASE FIX THIS and I may repurchase.  Interesting that there are so many comments marked \"Helpful\" when they are \"rah rah\"...but there are some big-time shortcomings that people should consider and not be swayed exclusively by only positive reviews.  One additional - Be sure you don't mind a 10x-15x to 1 rendering ratio on even the latest of computers.  1min of footage will take 10-15min to render.  For reference, my latest top of line Macbook Pro it's 10 to 1."},
{"Review_ID": "R1ZJIKC08W8481", "Author": "j", "Review": "Does what I need: 360 video, decent stabilization, color, record and battery time. Footage can be edited in Adobe Premiere using their Reframe plugin."},
{"Review_ID": "R1QB9ZMNA1TVBV", "Author": "Edvaldo", "Review": "THE BEST CAMERA"},
{"Review_ID": "R3N7DJYTMOOTAC", "Author": "Patrick H.", "Review": "top product!"},
{"Review_ID": "R25EXQE8MSQJQV", "Author": "Jerrico Usher", "Review": "Incredible camera- I have the gear 360 and this makes it look like a vhs! The quality of output is the best I've ever seen!"},
{"Review_ID": "RI1ESEM6M7I6Y", "Author": "rt66west", "Review": "A interesting camera From Go Pro. Good for VR people who want to create their own VR movies. Bigger battery from other GoPro Models, can do 5k video."},
{"Review_ID": "RMKGRZZHRPVY9", "Author": "Daniel", "Review": "I rarely write reviews and I rarely write bad reviews, but this product has issues.  The hardware is nice.  It seems to be able to capture videos and you can view the videos on your phone or iPad quite easily.  The issue is exporting the videos is impossible for me (tried on a Surface Pro, iPad, iPhone X, always get an error when sharing).  The software in general is buggy and it pesters you to buy subscriptions or install other tools. In a nutshell, this product bothers me a lot.  Hardware is great, but the software pretty much makes it useless.  And it costs a lot of money. I would like to update this review to something nicer if I can ever get the thing to work.  I am not holding my breath, though."},
{"Review_ID": "R3CO1O99E1QDKH", "Author": "K. K", "Review": "Very poor picture quality. Takes ages for video to upload and render. Buggy software. Found myself wasting hours and hours trying to just get a short video stitched and uploaded."},
{"Review_ID": "R24GJP7I3RW8AW", "Author": "Ernie Berlic", "Review": "Software is buggy, The Fusion wont connect to common Android devices. From the stitching I've seen so far, poor. Wish I had spent my money on a Insta360 One for Android."},
{"Review_ID": "R1OE6365X3TX6", "Author": "Henry", "Review": "So the ad doesn't lie.  You can shoot 360 degree video, you can do all sorts of things with this amazing camera it seems, however (and this is a big however) if you own an Android device, congratulations, you've just bought a very expensive door stop. There is very very limited support for Android devices at the moment, in fact this isn't supported at all on the Galaxy S5, my cheapo Chinese Android tablet, my galaxy S8+  nor is it supported on my Galaxy Tab 3.  The only android device I can get it to work with is a Galaxy S7.  Even then, the most you can do is download short 30 second video clips.  You cannot even download or edit any of the video or photos it takes with your android device.  However, don't worry, as according to gopro, you can use the desktop PC app \"Fusion Studio\" to retrieve and edit your footage.  Great for all of those on the go people who want to take photo's or shoot short video's, just bring your entire desktop PC with you...  However that Laptop or PC better be running Windows 10, it better have 8GB of ram because if not, even the GoPro fusion studio itself won't work.  Seriously, until this device gets full Android support, I would honestly skip on buying it for now.  There are cheaper and more compatible options out there. **updated 6/26/2018** Finally some updates worth talking about.  Android does have some support at this time, however the app is a bit strange to deal with.  You first of all have to download the 360 footage to your phone via the app (and you can only download it directly to the phone and not the SD card, this means that you're limited to about a 33 second clip).  You then have to exit out of the camera on the app, go into the splash screen, select \"media\", select the \"local\" tab and then edit your footage from there.  You can take a screen shot (photo) and re-frame it, then upload to facebook or instagram.  You can also do the same with 33 seconds of 360 footage.  You basically record the angle you want, but while recording you can pinch to zoom in or out or you can turn your phone around in your hands in the internal gyroscope will track your movement.  This however can lead to slightly jerky looking footage, you may want to sit yourself in an office chair and spin around slowly for a panning effect.  On one hand the inability to do smooth pans via the app is bad, on the other hand, who ever thought you could use an office chair as a video editing tool?  That's actually kinda fun.  The main problem though is the lack of video stabilization, you only get that by using Fusion Studio on your PC.  You also can't put any graphs on your footage (info taken from the GPS) unless your run it through the Fusion Studio either. I raised my review by one star for finally getting some android support, but I still think this camera is too big, too square and lacking in proper hardware based solutions to be a true 360 breakthrough camera.  I hope that if GoPro do another version, they address these issues and improve the usability of their app. UPDATED: 8/31/2018: So I've updated my review after owning this camera for quite a while and now I have to say, it's my favorite gopro to shoot video with.  I find that the ability to reframe shots after you've recorded them to be immense fun as well as hugely practical.  It's like having multiple cameras set up for a shoot.  However the problem with this camera is that you'll get back exactly what you put into it.  If you just buy the camera and only expect to use your android device to edit video with, then you're going to end up with shakey video, poor pans and the ability to only export 33 seconds at a time.  To get better use out of the camera, you're going to have to get either a PC or Laptop with some very decent specs and use the Go Pro Fusion Studio software.  That  gives you full camera stabilization (which borders on supernatural at times it can be so smooth) but you're looking at quite a cost (I spent about $1300 on my setup).  However, the fusion software only lets you export a static view (so no active panning or zooming shots).  Which means to get full use out of the software and footage, you're going to have to export your footage as a 360 degree video and then import it into something like Adobe Premier Pro (which will cost you about $25 per month for a license).  Only then will you be able to make the stunning video's you want.  So shooting in 360 gets awfully expensive fast............... and yet...  I'm finding it's worth it.  Not only is the video footage stunning but the options for your finished product are endless.  Although I love the image quality produced by the GoPro Hero 6, it's the ability to reframe, pan and zoom in post production that makes the GoPro fusion really stand out.  I wasn't impressed when I first got it, but now that I've owned it for a while, I'm loving what I can do with this camera and what lies down the road for me.  It may not be 5 stars due to the costs involved, but it's a very well earned 4 stars."},
{"Review_ID": "R3FA0I8WKLG6KP", "Author": "Amazon Customer", "Review": "major Pain in the ass. Gonna wait for 3rd gen like I usually do. This was crap tho. Real big disappointment"},
{"Review_ID": "R3VAHKE69CVQO7", "Author": "Amazon Customer", "Review": "Nice 380 camera"},
{"Review_ID": "R3V5E3MGQF251L", "Author": "UkrainianGirl", "Review": "I've never justified spending time on reviews but this thing drained time from my vacation, so here it goes... PROS: 1) It is waterproof without any additional cases 2) The tripod it comes with is very nice 3) It has GoPro brand name. That's about it... CONS (in no particular order): 1) Stiches between the video streams are highly visible 2) No internal storage. You need to buy not one but TWO SD cards 3) The software has functionality to trim clips but it does not work: sliders get stuck and it's impossible to move them 4) After 20 mins of work or so it get's Very Very hot 5) Camera gets frozen / impossible to turn off. The only way is to pull out battery 6) Video can be saved neither to phone nor laptop. The phone app was giving me error with no explanation each time I was trying to save a clip. The Fusion Studio was also erroring out. I had to reserve to plugging out the two SD cards and manually copying files to the laptop. I'm yet to figure out a way to stich the front and back videos out of those files. 7) I was recording for 20+ minutes and ended up with multiple 7 minute clips: seems like it shuts down after 7 minutes of inactivity or smth. Good power saving but why would you do it while video recording is running??? 8) Video quality is very bad: grainy, with blurred focus. Daytime recordings with cloudy skies. Replayed on the phone. 9) Battery runs out very fast: it lasts for about half an hour just to watch videos while connected to the phone Tested with IPhone 6 PLUS and MacBook Air - latest OSs on both. Will update with video/photo samples if I'm ever able to transfer them somewhere. P.S.: I've had awesome experiences with GoPro cameras before. I did my research on 360 cameras, and purchased this specific camera only because of the brand name. It's a shame for such a company to make its users feeling like testers of an alpha product."},
{"Review_ID": "R2WLN6M59NPHFY", "Author": "M. Ty", "Review": " If you haven't tried a stabilized 360 camera before, prepare to have your mind blown (see the video I uploaded sorry i don't know why Amazon drastically reduced the resolution.. anyway it's also viewable on youtube). I have forty-two 360 cameras and panoheads, and as of March 2018, Fusion has the highest video quality for consumer 360 cameras under $1,000.  Even though its nominal resolution is lower than that of the Virb 360 or Yi 360 VR, Fusion has noticeably more detail than either of them or any other consumer 360 camera.  Its video quality is so high that it is almost as good as my $3,500 Insta360 Pro in 8K mode.  Fusion's stabilization is also excellent, although the stabilization is a bit below that of the Rylo.  Its photos are pretty good as well, again with excellent dynamic range. The main issues with Fusion have been: 1. lack of an external housing, and 2. the workflow needs improvement for both desktop and mobile."},
{"Review_ID": "REGBFTE9UD55N", "Author": "SD7", "Review": "I got this as a gift and it is by far the worst GoPro product made. a. Not intuitive to use. It turns on and off when I am trying to change the mode. b. The Software, which is a big part of the product's purpose, is poorly crafted. It does a terrible job of stitching and editing. c. You'll just struggle and waste time trying to make this product work."},
{"Review_ID": "R3I2Z9II51MRIJ", "Author": "Daniel R", "Review": "This has been a great camera for capturing moments with my family. It's like bringing a videographer with us everywhere we go. With every angle captured you never have to worry about where the camera is facing. You truly can just set the camera down and know that no matter where the action occurs, you will have filmed it. I primarily take the 360 footage and create normal 2D videos in Adobe Premiere or utilize overcapture to make short sharable videos with my Galaxy S7. The photos taken by Fusion are amazing but almost equally are good are the frame grab photos you can get from videos. As far as usability, this is a camera that is taking 5.2K resolution video so if you don't have a computer capable of handling 4K editing, you won't really be able to get the most from this camera. Additionally, if you don't have Adobe Premiere or After Effects, you will be limited to editing on an iPhone 6S or newer or a handful of premium Android phones. The stitching time in Fusion Studio does take awhile (although not as long as I was led to believe by other reviews), so you need to be prepared to invest some time into your edits. For making short videos on your phone it's about a ten minute process for a 30-60 second clip so there is some time investment going that route as well. All in all though, the time invested always seems worth it once you get to the finished product. Fusion is not a camera for just anyone. If your computer doesn't exceed, or at least meet, the system requirements, then you shouldn't be thinking about this camera. However, if you do have the right tools, you won't be disappointed in the beautiful photos and videos you can achieve with this camera."},
{"Review_ID": "RSNE9GD54A6RC", "Author": "Mario Romero", "Review": "Excelente cámara! Unas fotografías increíbles."},
{"Review_ID": "R30AUVY5BJ1B7B", "Author": "Andrea Polk", "Review": "I was so excited to receive the GoPro Fusion camera, but my excitement quickly faded when I encountered issues with the GoPro app on my iPhone and the Fusion Studio app on my Mac. Having a Hero4 I'm no stranger to the GoPro universe, but I find the learning curve with the Fusion a bit steeper than expected. I had to download the PDF user manual and even after referencing it several times, I still feel like I'm struggling to 'get it'.  That's me I guess, and I am committed to getting better and knowing more. However, I don't think the Fusion is for those who are not willing to put in the time to learn how to use it. It's not a simple point and shoot, and unfortunately, the software needed to fine tune it isn't really as good as it should be. Fusion Studio software looks like it's ready to go, but when the video is uploaded it becomes glitchy and tough to use.  I've tried the software on a Mac running the latest macOS and on a Windows 10 PC.  Both have core i7 processors and ample memory, so I thought I'd be OK.  Windows does better than the Mac for me, yet it all still feels uncomfortable and harder than it should be.  Disappointing, but I'm crossing my fingers for updates to this software that will make things smoother with time. I struggled to get my Fusion to upload video and stills to my iPhone's GoPro app.  The app had recognized the camera and connected via Bluetooth without an issue.  Preview windows of the video and stills showed up as blanks with exclamation points inside them, but no photos or videos appeared.  I could not view them, nor could I upload them to save. I was able to connect my Fusion camera to both the PC and Mac directly and upload that way.  Something I was trying to avoid as it's generally so much simpler to do it wirelessly. The build quality of the Fusion camera seems on par with the other GoPro cameras.  It has voice activated commands which make it much easier to use than those which do not.  Its ability to shoot video in 5K 360 is amazing, but you have to have powerful, user-friendly software to tweak footage and so far, that's not part of the package. To be fair there are other programs that can manipulate the GoPro Fusion's output files, but for the price point, that shouldn't be a requirement for enjoyment of this cam. To date, I've yet to really be able to fully enjoy this camera due to app and software issues.  If I can resolve these issues I will update this review and increase the star rating. NOTE:  Users will need (2) microSD cards capable of 4K+ video installed to get started using this camera.  These are not included with the Fusion.  The camera does come with a selfie stick that transforms into a tripod if desired, as well as a semi-hard case for the camera."},
{"Review_ID": "R29UA1DRIZZCT0", "Author": "Pedro P. Cunha", "Review": "Fusion is a great idea but unlike most of the GoPro products, it needs a lot of refinements. I had lots of issues in making it work for the first time and am still getting used to it in making decent videos. But my main frustration is that GoPro does not make it clear that it is useless underwater - the primary reason I bought it; the optics simply do not work underwater, image becomes soft and you can clearly see stitching lines. Waste of money and time in my case,"},
{"Review_ID": "R3MYRSTN4J9UTD", "Author": "Jerry Saperstein", "Review": "Admission: I love the GoPro Fusion.  Admission: the GoPro Fusion workflow is not easy to learn.  In my opinion, the GoPro Fusion is a superb device. It delivers 360-degree videos with stunning detail and clarity. Still images don’t have quite the crispness of video, but are still “wow” quality.  But working with the GoPro Fusion is not going to be everyone’s cup of tea. It is not as simple as working with any of the GoPro Hero or Session cameras.  The details and specs of the camera are well-covered elsewhere, so I won’t repeat them here.  The workflow, however, is the subject of a lot of confusion.  GoPro released the Fusion with software, GoPro Fusion Studio, that was buggy and not ready for market.  With the current release, GoPro Fusion Studio is less buggy and easier to use – but you should look up and read current RELIABLE information. A lot of what you’ll find on the web about GoPro Fusion Studio is outdated, third-hand, inaccurate and often just plain wrong.  It took me a little experimentation to learn the ins-and-outs of Fusion Studio and I don’t consider myself a pro yet.  Render times are long. The attitude I’ve adopted is to load my footage, start the rendering process and walk away for as long as it takes, which may be many, many hours, depending on how much  you’re rendering. I haven’t been bothered with crashes – so far.  The results are stunning. Generally, stitch lines are difficult to find. If you’re filming people, make sure to orient the lenses so the split line doesn’t cross their faces.  GoPro includes plug-ins for use with Adobe Premiere and AfterEffects – and virtually no documentation on how to use them. If you don’t already know Premiere, you’re going to have to learn a little more than the absolute basics. It’s worth the effort, though, because you can then make full use of the GoPro OverCapture feature which essentially allows the Fusion to act as if it were multiple cameras.  Once your Fusion footage been rendered, you can use other programs for editing, such as those intended for Insta360 or Garmin VIRB.  In the end, all the learning, all the work, is worth it for the results you can achieve. I consider myself a beginner and I am still learning, but I am turning out what I think are awesome results.  Consider that the GoPro Fusion is a every expensive 360-degree camera. On top of that, you have to buy two high-quality and expensive microSD cards. And you need to have access to or own Adobe Premier or AfterEffects. Then you have to spend a lot of time learning how to use the Fusion camera, the Fusion Studio software and the Adobe program plug-ins.  Is it worth it? I don’t think everyone will think so.  But for those willing to make the effort and spend the money, the results will be outstanding. Jerry"},
{"Review_ID": "R1AYIFTEMT42SI", "Author": "M. Hill", "Review": "The Fusion captures everything in clear, sharp high definition. Unlike a normal single field-of-vision video or photo camera the image is a spherical/fish-eye virtual reality (VR) 360 degree view, so nothing is missed. But, if the intension is to share anything but VR, the output needs to be precisely edited to make useable.  Operating this camera entails a number of software programs and an app as well downloading and installing files, etc. This is not a plug and play device. The software both inside the camera and for the PC/Mac needs to evolve particularly in the ease of use area which is why the review is four and not five stars. And, even being reasonably comfortable with computer software, and somewhat (amateur-level) experienced with single perspective editing, the re-framing and rendering for the camera is different and requires commitment, practice and a powerful computer with plenty of memory. I used the camera with a current iOS 11.4 device (iPhone) and had no issues with the mobile app. The first step is loading the app from the Apple App store. The correct one is named--GoPro formerly Capture. An account must be established with GoPro that consists of simply an email address and password. If interested in additional setup details and issues encountered they are included further down in the review. Note that the information included with the device is minimal but a 70 plus page Manual is on the website in the Support area and it provides detail on a wide range of information even explaining how to hold the camera if not using a stand or mount. The camera has two lenses facing in opposite directions, slightly offset, each capturing a spherical field of vision (FOV) image. It can be used for regular and slow motion videos along with still and time-lapse photography. Various settings are possible using the 3/4 inch square LED screen on the camera by cycling through the options with the mode and shutter buttons. The beauty of shooting 350 degrees, particularly in an action sequence is a view finder isn’t a necessity because everything is being captured. Most of the settings are also available on a connected Apple or Android mobile device. Some functions are also accessible with voice commands, such as--GoPro Start Video and GoPro Stop Video, etc. Utilizing the voice option can inadvertently stop and start recording if the name is said within ear-shot of the device so there are times it may be best disabled. It requires two not-included microSD cards. I used two 32GB SanDisk Ultras one each for the front and back lenses so when a picture or video is captured there is one 180 degree image on each card. The free GoPro software on the website for either mobile, PC or Mac stitches the two together for a 360 degree image. A connected mobile device can be used to control the camera for capturing videos or photos and viewing them using the free GoPro app. The mobile device software on the website also provides some limited editing and file sharing capabilities. The PC or Mac software offers the most comprehensive options so Images from the device can be copied, viewed and edited. From the official home site, I downloaded free Fusion Studio 1.2.1.400, VR Player 3.0.5, and Quik 2.6.1.780. Captured files can be viewed or edited on a PC or Mac, either directly from the camera connected to a USB port, or copied by taking the microSD cards out of the camera and copying them to the computer’s hard drive. I plugged the camera into a Dell Laptop running the latest version of Windows 10. Two drives appeared in the list of storage devices--Fusion Front and Fusion Back. All file names consist of a sequential four digit number preceded by “GPFR” or “GPBK” for the front and back images respectively. Photos are stored as “jpg” files and videos are “mp4” files. The Studio software requires 8 GB of available memory in Windows, and although I have that installed on my laptop it displayed a message saying there was not enough memory to run the program. A button with the message--Return to Fusion appeared and when clicked the program seemed to work anyway, presenting the choice to load from the attached camera or to find the files on the disk. Editing video was very slow and choppy directly from the camera, so I copied the files to the PC hard drive by inserting the microSD cards into the computer’s card reader. The program warned me once again that there was not enough memory, but continued to work. The editing was a bit faster and less choppy, but the software crashed a few times and had to be re-started--certainly not optimal. Later, I tried again on a desktop Windows 10 computer with 16 GB of memory, and the editing was much smoother, faster and did not crash. This is a complex device and requires dedication to master. With the Studio software, the spherical photo or video can be turned into something that looks like it was shot from a regular digital camera. This I relatively amazing because when you are capturing the image, the camera does not have to be pointed at anything in particular. It records everything above, below, in front or behind. Using the software, with the tools included, it can be re-framed with OverCapture, stabilized, stitched, rendered, and colored so the final product can be a still or a video that includes things you didn’t even know you were recording. The software has improved from the original release and should continue to evolve so it will be easier to use. Setup Details. Initially when the app started it connected to the camera and indicated there was a software update but in spite of repeated attempts it just wouldn’t load. I checked the website’s support area and browsed the detailed User Guide and found how to load the update manually. After following the steps and re-starting the app and completing the connection sequence the camera worked immediately. Included is small visual guide that details things like inserting and charging the rechargeable battery (included) and where to insert two micro SD cards (not included). The brochure shows how to attach the mounts or if not needed, completely remove the reciprocal portion attached to the camera. I next charged the battery with the included USB-C to USB-A cable. Cable length is approximately 18 inches. Battery charging takes approximately two hours. I noticed while charging the camera gets warm and during operation depending upon length of usage it can get hot. When not recording, the camera automatically turns off after 7 minutes. When recording a video the camera automatically saves the files in segments called chapters. These files are created every 5 minutes and each is approximately 4 GB. There is no way to alter chapter size but when played back directly from the camera the video appears seamless. When put together with editing software it also plays as one continuous video. The device is stated to be waterproof up to 16 feet. A tripod is also included along with three camera mounts to position the device either on a flat surface, a slightly concave or tripod. Comes with a zippered 3 1/2 by 3 1/2 by 1 1/2 inch semi-rigid storage case which should provide decent protection."},
{"Review_ID": "R709RTGTSANA4", "Author": "Rob C.", "Review": "Hands down one of the coolest cameras I've ever used. The mobile over capture feature is amazing, seamless, and makes the whole process extremely user friendly. Fusion studio needs a little work but that can be updated over time via software updates for the desktop. I can't believe how easy it was to keep up and running with this, zero learning curve!"},
{"Review_ID": "R1EYA3IUQ2NOTV", "Author": "S. Sande", "Review": "Disclosure: I purchased my Fusion directly from GoPro, not from Amazon. I've had the Fusion since last November and use it professionally as I do 360 work for Google Street View and for clients as well. Pros: Great battery life. I can often go on a trip and shoot hundreds of photos as well as a lot of video without recharging. Wonderful outdoor photo quality. I find that my shots done in full daylight are incredibly crisp and clear, with excellent color matching. Cons: Stupid button placement. It's so easy to accidentally take a photo with this camera (or even worse, video) by accidentally pressing the shot button, which you WILL do because that's where your hand tends to go when you're trying to pick it up. Battery door likes to fall off On-device settings menu is poorly designed, although you eventually get used to it Often get a purplish hue when photos are taken inside The worst part? The apps. I use both the iOS app -- which isn't too bad and quite handy for taking tripod shots via Wi-Fi when you're hiding out of the way -- and the Mac app. The Mac app is set up to launch when the Fusion is attached, and it NEVER works. Even when the app is launched, it doesn't see the camera. What I end up doing is removing the twin micro-SD cards, reading them to a directory on the Mac, then forcing the app to look at that directory for stitching. Even on a fairly fast iMac, stitching is slow for photos and dreadfully slow for video. My biggest complaint is the color quality when taking photos indoors. Sure, I can often clear up the odd hues in post-processing, but I'm looking for a much faster workflow and don't want to spend the extra time doing color adjustment. If you're going to shoot outdoors exclusively, then by all means get the Fusion -- it excels on shooting photos and video outdoors. Just be aware that you're probably going to be frustrated with both the mobile and desktop apps. For indoor work, try something else because you'll be disappointed with the quality you get. This was my first GoPro product and will definitely be my last."},
{"Review_ID": "RT1CMB9IEBBKA", "Author": "Daniel", "Review": "I bought the GoPro Fusion just because I was curious whether 360 photography/videography actually makes sense for someone who doesn't use a VR headsets and is not into extreme sports. After playing with the Fusion just for a few minutes I already got pretty excited and then took it with me on a 2 week trip through Japan. The photos and videos I could take with the Fusion are simply incredible - the fish eye and little planet videos look simply cool and the 360 photos/videos let you feel you're back on vacation even weeks after you're back home. The Fusion will from now on go on every trip with me! My only wish for the future, please make the GoPro apps and FusionStudio better (much better ;))"},
{"Review_ID": "R2WT6COUA0DFPE", "Author": "David Bannish", "Review": "Like an exotic sports car the up-front cost is only a portion of the capital investment you are making. Sure, if you already have an expensive smartphone you can connect to the GoPro fusion via the app and get some usability, but this approach has limitations with respect to stitching the image together into one, clear, spherical image. Where the GoPro Fusion really shines is when the images are processed on a desktop computer, the image is beautiful as if you are looking through a literal \"eye in the sky\". The one caveat (and it's a big one) is your desktop computer must be an absolute BEAST of a machine in order to process the footage in any reasonable amount of time, if at all before the RAM is exceeded and you have to give up hours later. To put this in perspective, you will probably need a video-processing desktop currently priced at $2K-$3K+. I have been successful at making clips up to 5 minutes long work on my computer with 8GB RAM and 2G DDR5 GPU, however, that is only after I had to tune down the resolution to 2K, and the stitching process still took over an hour. On the back end, the stitched videos are not compatible with past versions of the GoPro Studio software, which is a remarkably good and intuitive means of video editing (GoPro why did you move away from this?). As an alternative, GoPro opted to offer a GoPro Fusion toolbox for an Adobe video-editing software, which is only available via a subscription basis, minimum $20 per month with no option to straight-up purchase. At face value, this is an excellent option for a professional in the video-editing field, but I have neither the patience nor the presence to justify changing what has already worked in the past for me. I gave Adobe an honest attempt, but perhaps my computer was not up to par, nothing seemed to work. For me, as someone that works for a living and casually makes films of my adventures for Youtube that purchased the GoPro Fusion without buying the additional multi-thousand dollar desktop and has a dislike for a lack of options when I am required to go through a third-party software, I am limited to producing 5 minute long, RAW clips with no edits, to Youtube in 2K format. Right here right now this camera is a novelty with the ability to fire on all cylinders and blow away competitors IF you have deep pockets. What I would like to see is for GoPro to bring Fusion support to their now-unsupported GoPro Studio Desktop software similar to the software that Garmin developed for their 360 camera, very slick. Of course, this could all be corrected as well if GoPro redesigned the smartphone apps to be compatible with Fusion 360 footage so I can make actual 360 movies (not just Overcapture clips, 360 has more replay value to audience), improve stitching on the smartphone, and ensure the stitching process on smartphone doesn't crash once it reaches 100% (for no reason). I have hope GoPro can pull this off on the software side of the house, the problem does not seem to exist with the camera itself........except for ONE thing.......the fisheye lenses work great until you want to use them as literal fish eyes under the water, then the diffraction of the water will ensure that you lose approximately 40 degrees from your field of view, IMPOSSIBLE to create a spherical image, even in the clamshell housing that's available on Amazon for about $50. Fortunately that housing necessarily protects the lenses since there is now way you can drop this camera WITHOUT it landing directly on a lens and scratching it, the problem is that the fish-eye is so extreme the camera is actually looking bat at itself, which distorts the final image. To resolve this you should be able to sandwich two acrylic domes >4inch diameter around the camera which will minimize distortion. I bought it, I'm moderately happy, will be significantly more happy as I do my custom hardware fixes and GoPro does necessary software updates."},
{"Review_ID": "R30QYALGLDSV1N", "Author": "Amazon Customer", "Review": "The footage captured with the camera is excellent. Let's start there. The stitching is really, really good as well. However.....software. This is a camera without a viewfinder or screen of any kind, so the only way you can tweak settings or actually SEE what you are shooting is by linking it to a phone or tablet. That's where this review lost three stars. Both the phone app and the software are MAJOR Cons that anyone purchasing this product needs to be aware of. PROS: Image quality is excellent. Videos, while not absolutely perfect at the seems, is still handled better than most other cameras in this price range. It does everything the Gopro Hero 6 can do, except in 3D CONS: There is ZERO protection for the lenses. If you drop it or bump it while you are shooting and scratch or crack a lens, your goose is cooked. GoPro has no option to replace the lens. SO BUY THAT ACCIDENT PROTECTION!!!! This is one area where the VIRB 360 from Garmin beats the pants off gopro. They are targeting the action cam market. How can you offer no protection for the lens given the kinds of things your target audience wants to use it for??? The phone app is horrendous. If you are on Iphone you will have a better experience than android, but just barely. Features crash constantly. If you are on android, you better hope you have one of ten SPECIFIC MODEL #'s of phone. Otherwise you can't pair your fusion to your phone at all. No matter how new or powerful your device is. That's something you won't see mentioned on the box or in the user guide. Android support is abysmal. The desktop software is improving, but still a headache. There is no getting around it. You MUST use Gopro Fusion studio to stitch your images. And that process takes a LOOOOOONNNNGGGGG time. It's also prone to crashing a lot. They recently added support to the app for the cameras HDR functions, kind of. If you click on that menu option it just gives you instructions on using third party software. It's a workaround more than a feature. Long story short, GoPro forced this one out too quickly and rather than catching up and making this thing worth the price we paid, they are basically just cruising till their next 360 cam comes out. If they don't fix the crippling problems with the android app, this will be the last GoPro product I ever buy."},
{"Review_ID": "R20PRJSYELDCBH", "Author": "Andrey Zubkov", "Review": "As others have mentioned, it's not ready for prime time. If you're getting the fusion at this stage, you are definitely an early adopter for a first gen product. Pros: - Shadows, contrast, stabilization, dynamic range are all surprisingly good. - I really like the tripod mount that came with it. Good grip, it's versatile, it's stable. And the camera is designed to edit it out - Ability to edit video on your iPhone Cons: - The desktop software is so buggy it's unusable. I'm not being overly dramatic: files will just stop importing, they'll import and then won't get picked up while rendering, and other time-wasting BS issues that should've been caught during testing - You need a serious spec'd rig to process videos. On a 2016 i7 15\" Macbook pro w/ a ridiculously fast SSD, you're looking at 1min of video taking 30 mins to render. - The phone editing option has a cool interface, but is slow and eats right through your battery - Video files are HUGE. Be prepared to use tens and hundreds of GIGS of HDD or phone space. I get it, it's 5K video in 60fps, but maybe try some compression? - Ability to share 360' video is still limited: basically facebook or google. - It's $700 . If you're willing to step down to a 4K resolution, you're looking at great competitors at $300. I feel terrible writing this, because I really liked what GoPro was doing all these years. But if this is where we're going, I'm just not ready to sink this kinda cash for a beta product hitting the market. I did get a Hero6 instead, and I'm happy with the conventional video quality there."},
{"Review_ID": "RW8QUYW2W2NFS", "Author": "K. Nguyen", "Review": "Wasted too much time and money on this. It'll run extremely hot (while charging and recording) and also the stitching software doesn't work on most graphics cards. Get the qoocam instead, check out the youtube comparison reviews. That's the 360 cam i'm going for. GoPro also has 1 star BBB reviews. I've had nothing but problems with this company the last 2 purchases. No more."},
{"Review_ID": "R2R92DEYMSVJ6V", "Author": "Justinline", "Review": "My GoPro Fusion shows black when I try to use the GoPro app as a preview screen (I have a OnePlus 6T). Also, when I take a picture and download it, it shows black in the GoPro app when I try to view the image. The app also fails to recognize that I downloaded any images or video.  This camera has been way more trouble than it's worth. I bought a new computer to handle the bloated software, but the Fusion software doesn't work correctly to import images directly from the camera on Mojave OS 10.14.2.  For GoPro customer support, all troubleshooting and a multitude of customer service calls have been useless.  They are also refusing to give me a refund.  A camera this expensive should not have such issues."},
{"Review_ID": "R3PZFIOIB5415Y", "Author": "Erik Flinck", "Review": "Warning, make sure not to get the grip wet, when wet the O-rings dies and you cant extend or collapse the stick anymore. According to customer support it is \"user fault\" and they cant help out... So basically Gopro is selling waterproof action sport equipment that breaks down when wet, and that is the customers fault"},
{"Review_ID": "RENMWMVYIXN74", "Author": "honest buyer", "Review": "Picked up a unit and put it to the test and love it. The software update made a huge difference in stabilization and a night and day improvement. Make sure you use the APP and get the updates!  The stitching is so seamless you cannot even tell where it is which is the key differentiation to the competition. The entire over capture feature is hands down the reason to buy this! This is a must have for architecture and interior photographers and I think with continued updates this by far is going to be a clear winner."},
{"Review_ID": "R26DTW33RG6URB", "Author": "Hsiao-Tien K Wang", "Review": "The Fusion is a very unique camera.  The 360 view gives a really cool perspective.  I like the interface with the phone and how quickly you can download the files from the Fusion to my phone."},
{"Review_ID": "R23PMTDWKY7HAF", "Author": "superboy2001", "Review": "We live in an HD world with HD expectations. I have tried 4 different 360 cameras before Fusion and had the same issue with all of them. The video quality was unacceptable and in most cases unusable. Fusion is the exception to the rule due to the following: 1) Fusion captures content in 5K and creates stunning 360 videos. 2) Using the extremely intuitive app, you can create a 1080P non-360 punch out from the 360 video. This 2D video content can than be used as part of a larger project. 3) Fusion finally lets consumers realize the true power of 360 video which is the ability to capture every angle and later decide which angles you want to share with the world. Overall, GoPro Fusion is the 360 camera you have been waiting for. Once used, you won't want to put it down."}
]